
## Plan Result (aat)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.environment
* Update
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.environment will be created
  + resource "azurerm_key_vault_secret" "environment" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.KeyVault/vaults/em-icp-aat"
      + name                    = "environment"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Cache/redis/em-icp-redis-cache-aat"
        name                               = "em-icp-redis-cache-aat"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (13 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1450,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->